### Pandas 

- Pandas is a Python library, that is used to manipulate the data as we do in MS-Excel
- It stands for Panel data

### How to import Pandas?

In [1]:
import pandas as pd

### Version

In [2]:
pd.__version__

'2.0.3'

### In pandas, we will work upon two objects 

- 1. Series
- 2. DataFrame

### How to a Create a Series 

Syntax:
        
        pd.Series()

#### Creating a series using a list or a tuple

In [3]:
lst = [i for i in range(1,11)]
lst

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [4]:
s = pd.Series(lst)
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [5]:
print(type(s))

<class 'pandas.core.series.Series'>

In [6]:
s.shape

(10,)

#### A series contains two object 

- The first object is the index object
- The second object is the values associated at that particular index

In [7]:
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [10]:
name = ['Mayank', 'Geetika', 'Rishabh', 'Deepak', 'Krati', 'Sumit']
emp = pd.Series(name)
emp

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
4      Krati
5      Sumit
dtype: object

In [11]:
name = ('Mayank', 'Geetika', 'Rishabh', 'Deepak', 'Krati', 'Sumit')
emp = pd.Series(name)
emp

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
4      Krati
5      Sumit
dtype: object

### Attributes on a Series

#### size 

- It returns the number of the element inside the series

In [12]:
emp

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
4      Krati
5      Sumit
dtype: object

In [13]:
emp.size

6

In [14]:
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [15]:
s.size

10

#### dtype

- It returns a datatype of the values that the series contain

In [16]:
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [17]:
s.dtype

dtype('int64')

In [18]:
emp

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
4      Krati
5      Sumit
dtype: object

In [19]:
emp.dtype

dtype('O')

#### ndim

- It returns the dimension of the series

In [20]:
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [21]:
s.ndim

1

In [22]:
emp

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
4      Krati
5      Sumit
dtype: object

In [24]:
emp.ndim

1

#### shape

- It returns the shape of the series

In [25]:
emp.shape

(6,)

#### index 

- It returns the rangeindex of the object that contains the indices of the obejct

In [26]:
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [27]:
s.index

RangeIndex(start=0, stop=10, step=1)

In [28]:
emp

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
4      Krati
5      Sumit
dtype: object

In [29]:
emp.index

RangeIndex(start=0, stop=6, step=1)

### values 

- It returns an array that contains values from the series

In [30]:
s.values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10], dtype=int64)

In [31]:
emp.values

array(['Mayank', 'Geetika', 'Rishabh', 'Deepak', 'Krati', 'Sumit'],
      dtype=object)

#### name

- It is used to name the series

In [32]:
emp

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
4      Krati
5      Sumit
dtype: object

In [33]:
emp.name = 'Employee_names'

In [34]:
emp

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
4      Krati
5      Sumit
Name: Employee_names, dtype: object

### Case-2 

##### Create a Series using a dictionary 

- When we create a series using a dictionary, then the keys from the dictionary becomes the index and the values from the dictionary will become the values in the series

In [35]:
info = {'ID':101, 'Name':'Mayank', 'Age':29, 'City':'Bengaluru', 'Company':'Learnbay'}
info

{'ID': 101,
 'Name': 'Mayank',
 'Age': 29,
 'City': 'Bengaluru',
 'Company': 'Learnbay'}

In [36]:
type(info)

dict

In [37]:
info_ser = pd.Series(info)
info_ser

ID               101
Name          Mayank
Age               29
City       Bengaluru
Company     Learnbay
dtype: object

In [38]:
type(info_ser)

pandas.core.series.Series

### Index of a series 

- Implicit Indexing (pandas defined ) 0 to len(ser)-1
- Explicit Indexing (user defined ) are sometimes called as labels

In [39]:
name

('Mayank', 'Geetika', 'Rishabh', 'Deepak', 'Krati', 'Sumit')

In [40]:
s = pd.Series(name)
s

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
4      Krati
5      Sumit
dtype: object

In [41]:
s.index

RangeIndex(start=0, stop=6, step=1)

#### How to pass user defined indexes (labels)

In [42]:
name

('Mayank', 'Geetika', 'Rishabh', 'Deepak', 'Krati', 'Sumit')

In [43]:
s = pd.Series(name, index = list('abcdef'))
s

a     Mayank
b    Geetika
c    Rishabh
d     Deepak
e      Krati
f      Sumit
dtype: object

In [44]:
s.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [45]:
import numpy as np

In [49]:
ser = pd.Series(np.array([1000,2000,3000,4000,5000]))
ser

0    1000
1    2000
2    3000
3    4000
4    5000
dtype: int32

In [50]:
ser.index = ['num_1', 'num_2', 'num_3', 'num_4', 'num_5']

In [51]:
ser

num_1    1000
num_2    2000
num_3    3000
num_4    4000
num_5    5000
dtype: int32

In [53]:
ser.index

Index(['num_1', 'num_2', 'num_3', 'num_4', 'num_5'], dtype='object')

In [62]:
country = ['India', 'Russia', 'Vietnam', 'China', 'U.K.', 'Japan']
capitals = ['New_Delhi', 'Moscow', 'Hanoi', 'Beijing', 'London', 'Tokyo']

In [63]:
cc = pd.Series(capitals, index = country)
cc

India      New_Delhi
Russia        Moscow
Vietnam        Hanoi
China        Beijing
U.K.          London
Japan          Tokyo
dtype: object

### How to access an element from a series

In [64]:
s

a     Mayank
b    Geetika
c    Rishabh
d     Deepak
e      Krati
f      Sumit
dtype: object

In [65]:
s[1]

'Geetika'

In [66]:
cc[1]

'Moscow'

#### iloc and loc

##### iloc
    
   - It stands for index location 
   - iloc is used to fetch out the values on the bases of implicit indexing
   
##### loc
    
   - It stands for location
   - loc is used to fetch out the values in the bases of explicit indexing

In [67]:
s

a     Mayank
b    Geetika
c    Rishabh
d     Deepak
e      Krati
f      Sumit
dtype: object

In [68]:
s = pd.Series(name)
s

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
4      Krati
5      Sumit
dtype: object

In [70]:
s.iloc[1]

'Geetika'

In [71]:
s.iloc[5]

'Sumit'

In [72]:
cc

India      New_Delhi
Russia        Moscow
Vietnam        Hanoi
China        Beijing
U.K.          London
Japan          Tokyo
dtype: object

In [73]:
cc.iloc[4]

'London'

In [74]:
s.loc[1]

'Geetika'

In [75]:
cc

India      New_Delhi
Russia        Moscow
Vietnam        Hanoi
China        Beijing
U.K.          London
Japan          Tokyo
dtype: object

In [76]:
cc.loc[1]

KeyError: 1

In [77]:
cc.iloc['India']

TypeError: Cannot index by location index with a non-integer key

#### Slicing over the Series

Syntax: 
    
- s.iloc[starting_index: ending_index: step_size] (implicit indexes) (act similar to the normal slicingof the string that we have studied)
- s.loc[starting_index: ending_index: step_size] (explicit indexes) (labels) (here the ending index will be included so we dont have to give n+1 index)

In [79]:
cc

India      New_Delhi
Russia        Moscow
Vietnam        Hanoi
China        Beijing
U.K.          London
Japan          Tokyo
dtype: object

In [80]:
# Fetch the series in the reverse order using iloc method

cc.iloc[::-1]

Japan          Tokyo
U.K.          London
China        Beijing
Vietnam        Hanoi
Russia        Moscow
India      New_Delhi
dtype: object

In [82]:
# Fetch out the first two rows using iloc

cc.iloc[:2]

India     New_Delhi
Russia       Moscow
dtype: object

In [83]:
cc

India      New_Delhi
Russia        Moscow
Vietnam        Hanoi
China        Beijing
U.K.          London
Japan          Tokyo
dtype: object

In [85]:
# Fetch the first two rows using loc method

cc.loc['India':'Russia']

India     New_Delhi
Russia       Moscow
dtype: object

In [86]:
s

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
4      Krati
5      Sumit
dtype: object

In [88]:
s.loc[0:4]

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
4      Krati
dtype: object

In [89]:
cc

India      New_Delhi
Russia        Moscow
Vietnam        Hanoi
China        Beijing
U.K.          London
Japan          Tokyo
dtype: object

In [91]:
# Fetch out the values at a step size of 2 with loc 

cc.loc[::2]

India      New_Delhi
Vietnam        Hanoi
U.K.          London
dtype: object

In [93]:
cc.loc[::2]

India      New_Delhi
Vietnam        Hanoi
U.K.          London
dtype: object

In [94]:
cc.loc['India':'Japan':2]

India      New_Delhi
Vietnam        Hanoi
U.K.          London
dtype: object

In [96]:
# Fetch all the 2nd elements in the reverse order

cc.loc[::-1][::2]

Japan       Tokyo
China     Beijing
Russia     Moscow
dtype: object

In [97]:
cc.loc[::-2]

Japan       Tokyo
China     Beijing
Russia     Moscow
dtype: object

In [98]:
cc.loc[0:2]

TypeError: cannot do slice indexing on Index with these indexers [0] of type int

### Operations on a Series

In [99]:
np.random.seed(10)
arr = np.random.randint(10,100,12)

In [100]:
arr

array([19, 25, 74, 38, 99, 39, 18, 83, 10, 50, 46, 26])

In [101]:
num = pd.Series(arr)
num

0     19
1     25
2     74
3     38
4     99
5     39
6     18
7     83
8     10
9     50
10    46
11    26
dtype: int32

### Sum

In [102]:
num.sum()

527

### Mean

In [103]:
num.mean()

43.916666666666664

### Median

In [104]:
num.median()

38.5

### Variance

In [105]:
num.var()

789.9015151515152

### Standard Deviation

In [106]:
num.std()

28.10518662367349

In [108]:
(num.var())**(1/2)

28.10518662367349

### Max

In [109]:
num.max()

99

### Min

In [110]:
num.min()

10

#### Sorting a series 

    Syntax:-
        
        ser.sort_values()

In [112]:
num

0     19
1     25
2     74
3     38
4     99
5     39
6     18
7     83
8     10
9     50
10    46
11    26
dtype: int32

In [113]:
num.sort_values()

8     10
6     18
0     19
1     25
11    26
3     38
5     39
10    46
9     50
2     74
7     83
4     99
dtype: int32

In [114]:
num.sort_values(ignore_index = True)

0     10
1     18
2     19
3     25
4     26
5     38
6     39
7     46
8     50
9     74
10    83
11    99
dtype: int32

#### Descending order

In [115]:
num

0     19
1     25
2     74
3     38
4     99
5     39
6     18
7     83
8     10
9     50
10    46
11    26
dtype: int32

In [116]:
num.sort_values(ascending = False, ignore_index = True)

0     99
1     83
2     74
3     50
4     46
5     39
6     38
7     26
8     25
9     19
10    18
11    10
dtype: int32

In [118]:
num.sort_values()

8     10
6     18
0     19
1     25
11    26
3     38
5     39
10    46
9     50
2     74
7     83
4     99
dtype: int32

### 2. DataFrame 

- It is a 2D array structure 
- It is considered as an excel table 
- It is a collection of rows and columns

#### How to create a DataFrame

Syntax:-
    
    pd.DataFrame()

#### Case-1  Using a 2D list

In [119]:
name = ['Mayank', 'Rishabh', 'Geetika', 'Deepak', 'Priya', 'Abha']
ID = [101,102,103,104, 105, 106]
city = ['Bengaluru', 'Nodia', 'Ambala', 'Chandigarh', 'Surat', 'Mohali']

In [120]:
lst = [name, ID, city]
lst

[['Mayank', 'Rishabh', 'Geetika', 'Deepak', 'Priya', 'Abha'],
 [101, 102, 103, 104, 105, 106],
 ['Bengaluru', 'Nodia', 'Ambala', 'Chandigarh', 'Surat', 'Mohali']]

In [122]:
df = pd.DataFrame(lst)
df

           0        1        2           3      4       5
0     Mayank  Rishabh  Geetika      Deepak  Priya    Abha
1        101      102      103         104    105     106
2  Bengaluru    Nodia   Ambala  Chandigarh  Surat  Mohali

In [124]:
df = pd.DataFrame(lst).T # Transpose (column will becomes rows and rows will become column)
df

         0    1           2
0   Mayank  101   Bengaluru
1  Rishabh  102       Nodia
2  Geetika  103      Ambala
3   Deepak  104  Chandigarh
4    Priya  105       Surat
5     Abha  106      Mohali

In [125]:
df.columns = ['Name', 'ID', 'City']

In [126]:
df

      Name   ID        City
0   Mayank  101   Bengaluru
1  Rishabh  102       Nodia
2  Geetika  103      Ambala
3   Deepak  104  Chandigarh
4    Priya  105       Surat
5     Abha  106      Mohali

#### Case-2 Using a list of list or tuple of a list etc

In [127]:
lst = [['Mayank', 101, 'Bengaluru'], ['Rishabh', 102, 'Noida'],['Geetika', 103, 'Ambala'], ['Deepak', 104, 'Chandigarh']]

In [128]:
lst

[['Mayank', 101, 'Bengaluru'],
 ['Rishabh', 102, 'Noida'],
 ['Geetika', 103, 'Ambala'],
 ['Deepak', 104, 'Chandigarh']]

In [129]:
lst1 = pd.DataFrame(lst, columns = ["Names", 'ID', 'City'])
lst1

     Names   ID        City
0   Mayank  101   Bengaluru
1  Rishabh  102       Noida
2  Geetika  103      Ambala
3   Deepak  104  Chandigarh

#### Case-3 Using a dictionary

In [130]:
emp = {'name':['Mayank', 'Rishabh', 'Geetika', 'Deepak', 'Priya', 'Abha'],
        'ID':[101,102,103,104, 105, 106],
        'City':['Bengaluru', 'Nodia', 'Ambala', 'Chandigarh', 'Surat', 'Mohali']}

In [131]:
emp

{'name': ['Mayank', 'Rishabh', 'Geetika', 'Deepak', 'Priya', 'Abha'],
 'ID': [101, 102, 103, 104, 105, 106],
 'City': ['Bengaluru', 'Nodia', 'Ambala', 'Chandigarh', 'Surat', 'Mohali']}

In [132]:
lst2 = pd.DataFrame(emp)
lst2

      name   ID        City
0   Mayank  101   Bengaluru
1  Rishabh  102       Nodia
2  Geetika  103      Ambala
3   Deepak  104  Chandigarh
4    Priya  105       Surat
5     Abha  106      Mohali

In [134]:
lst2.name = 'Employee_info'

In [135]:
lst2

            name   ID        City
0  Employee_info  101   Bengaluru
1  Employee_info  102       Nodia
2  Employee_info  103      Ambala
3  Employee_info  104  Chandigarh
4  Employee_info  105       Surat
5  Employee_info  106      Mohali

In [136]:
emp = {'name':['Mayank', 'Rishabh', 'Geetika', 'Deepak', 'Priya', 'Abha'],
        'ID':[101,102,103,104, 105, 106],
        'City':['Bengaluru', 'Nodia', 'Ambala', 'Chandigarh', 'Surat', 'Mohali']}

lst2 = pd.DataFrame(emp)
lst2

      name   ID        City
0   Mayank  101   Bengaluru
1  Rishabh  102       Nodia
2  Geetika  103      Ambala
3   Deepak  104  Chandigarh
4    Priya  105       Surat
5     Abha  106      Mohali

In [137]:
lst2.T

              0        1        2           3      4       5
name     Mayank  Rishabh  Geetika      Deepak  Priya    Abha
ID          101      102      103         104    105     106
City  Bengaluru    Nodia   Ambala  Chandigarh  Surat  Mohali

In [138]:
type(lst2)

pandas.core.frame.DataFrame

In [139]:
s = pd.Series(name)

In [140]:
type(s)

pandas.core.series.Series

### Attributes on a DataFrame

In [141]:
lst2

      name   ID        City
0   Mayank  101   Bengaluru
1  Rishabh  102       Nodia
2  Geetika  103      Ambala
3   Deepak  104  Chandigarh
4    Priya  105       Surat
5     Abha  106      Mohali

#### shape

In [143]:
lst2.shape

(6, 3)

#### size

In [144]:
lst2.size

18

#### dtype

In [146]:
lst2.dtypes

name    object
ID       int64
City    object
dtype: object

#### ndim

In [147]:
lst2.ndim

2

#### index

In [149]:
lst2.index

RangeIndex(start=0, stop=6, step=1)

#### values

In [151]:
lst2.values

array([['Mayank', 101, 'Bengaluru'],
       ['Rishabh', 102, 'Nodia'],
       ['Geetika', 103, 'Ambala'],
       ['Deepak', 104, 'Chandigarh'],
       ['Priya', 105, 'Surat'],
       ['Abha', 106, 'Mohali']], dtype=object)

#### columns

In [152]:
lst2.columns

Index(['name', 'ID', 'City'], dtype='object')

#### Indexing and Slicing on the DataFrame

#### Indexing

- Implicit Indexing (Pandas Defined) - iloc
- Explicit Indexing (user defined) - loc

In [154]:
lst2

      name   ID        City
0   Mayank  101   Bengaluru
1  Rishabh  102       Nodia
2  Geetika  103      Ambala
3   Deepak  104  Chandigarh
4    Priya  105       Surat
5     Abha  106      Mohali

In [155]:
lst2.iloc[0]

name       Mayank
ID            101
City    Bengaluru
Name: 0, dtype: object

In [156]:
lst2.loc[0]

name       Mayank
ID            101
City    Bengaluru
Name: 0, dtype: object

In [157]:
lst2.index = lst2.ID

In [158]:
lst2

        name   ID        City
ID
101   Mayank  101   Bengaluru
102  Rishabh  102       Nodia
103  Geetika  103      Ambala
104   Deepak  104  Chandigarh
105    Priya  105       Surat
106     Abha  106      Mohali

In [159]:
lst2.iloc[0]

name       Mayank
ID            101
City    Bengaluru
Name: 101, dtype: object

In [160]:
lst2.loc[0]

KeyError: 0

In [162]:
lst2

        name   ID        City
ID
101   Mayank  101   Bengaluru
102  Rishabh  102       Nodia
103  Geetika  103      Ambala
104   Deepak  104  Chandigarh
105    Priya  105       Surat
106     Abha  106      Mohali

In [161]:
lst2.loc[101]

name       Mayank
ID            101
City    Bengaluru
Name: 101, dtype: object

In [163]:
lst2.loc[106]

name      Abha
ID         106
City    Mohali
Name: 106, dtype: object

In [164]:
lst2.iloc[5]

name      Abha
ID         106
City    Mohali
Name: 106, dtype: object

In [166]:
lst2.iloc[len(lst2)-1]

name      Abha
ID         106
City    Mohali
Name: 106, dtype: object

### Slicing

In [167]:
lst2

        name   ID        City
ID
101   Mayank  101   Bengaluru
102  Rishabh  102       Nodia
103  Geetika  103      Ambala
104   Deepak  104  Chandigarh
105    Priya  105       Surat
106     Abha  106      Mohali

In [168]:
lst2.iloc[0:2]

        name   ID       City
ID
101   Mayank  101  Bengaluru
102  Rishabh  102      Nodia

In [169]:
lst2.loc[101:102]

        name   ID       City
ID
101   Mayank  101  Bengaluru
102  Rishabh  102      Nodia

In [170]:
lst2

        name   ID        City
ID
101   Mayank  101   Bengaluru
102  Rishabh  102       Nodia
103  Geetika  103      Ambala
104   Deepak  104  Chandigarh
105    Priya  105       Surat
106     Abha  106      Mohali

In [171]:
# fetch the first two rows and first two columns using iloc

lst2.iloc[0:2, 0:2]

        name   ID
ID
101   Mayank  101
102  Rishabh  102

In [172]:
# reverse of the dataframe

lst2.iloc[::-1]

        name   ID        City
ID
106     Abha  106      Mohali
105    Priya  105       Surat
104   Deepak  104  Chandigarh
103  Geetika  103      Ambala
102  Rishabh  102       Nodia
101   Mayank  101   Bengaluru

In [173]:
lst2.iloc[::-1, ::-1]

           City   ID     name
ID
106      Mohali  106     Abha
105       Surat  105    Priya
104  Chandigarh  104   Deepak
103      Ambala  103  Geetika
102       Nodia  102  Rishabh
101   Bengaluru  101   Mayank

In [177]:
lst2.loc[106:101:-1, 'City':'name':-1]

           City   ID     name
ID
106      Mohali  106     Abha
105       Surat  105    Priya
104  Chandigarh  104   Deepak
103      Ambala  103  Geetika
102       Nodia  102  Rishabh
101   Bengaluru  101   Mayank

### How to access a column

Syntax:
    
        
        df['column_name'] or df.column_name

In [179]:
lst2

        name   ID        City
ID
101   Mayank  101   Bengaluru
102  Rishabh  102       Nodia
103  Geetika  103      Ambala
104   Deepak  104  Chandigarh
105    Priya  105       Surat
106     Abha  106      Mohali

In [181]:
lst2['name'] # this will return a series

ID
101     Mayank
102    Rishabh
103    Geetika
104     Deepak
105      Priya
106       Abha
Name: name, dtype: object

In [182]:
lst2[['name']]

        name
ID
101   Mayank
102  Rishabh
103  Geetika
104   Deepak
105    Priya
106     Abha

In [183]:
type(lst2[['name']])

pandas.core.frame.DataFrame

In [185]:
lst2.name

ID
101     Mayank
102    Rishabh
103    Geetika
104     Deepak
105      Priya
106       Abha
Name: name, dtype: object

In [188]:
lst2[['City', 'name']]

           City     name
ID
101   Bengaluru   Mayank
102       Nodia  Rishabh
103      Ambala  Geetika
104  Chandigarh   Deepak
105       Surat    Priya
106      Mohali     Abha

In [192]:
lst2.iloc[0:4][['City', 'name']]

           City     name
ID
101   Bengaluru   Mayank
102       Nodia  Rishabh
103      Ambala  Geetika
104  Chandigarh   Deepak

In [193]:
df.index = [f'emp_{i}' for i in range(1,7)]

In [194]:
df

          Name   ID        City
emp_1   Mayank  101   Bengaluru
emp_2  Rishabh  102       Nodia
emp_3  Geetika  103      Ambala
emp_4   Deepak  104  Chandigarh
emp_5    Priya  105       Surat
emp_6     Abha  106      Mohali

In [196]:
df.loc['emp_1':'emp_3']

          Name   ID       City
emp_1   Mayank  101  Bengaluru
emp_2  Rishabh  102      Nodia
emp_3  Geetika  103     Ambala

In [198]:
df.iloc[0:3]

          Name   ID       City
emp_1   Mayank  101  Bengaluru
emp_2  Rishabh  102      Nodia
emp_3  Geetika  103     Ambala

In [199]:
df.iloc[0:3, 0:2]

          Name   ID
emp_1   Mayank  101
emp_2  Rishabh  102
emp_3  Geetika  103

In [200]:
lst2

        name   ID        City
ID
101   Mayank  101   Bengaluru
102  Rishabh  102       Nodia
103  Geetika  103      Ambala
104   Deepak  104  Chandigarh
105    Priya  105       Surat
106     Abha  106      Mohali

In [202]:
lst2.iloc[4::, 0:2]

      name   ID
ID
105  Priya  105
106   Abha  106

In [204]:
lst2.loc[105:106, 'name':'ID']

      name   ID
ID
105  Priya  105
106   Abha  106